app/views/experiences/edit.html.erb

             <div class="col-sm-10">
              <%= select_tag(:restaurant_id, options_from_collection_for_select(Restaurant.all, :id, :venue_name, @experience.restaurant_id), :class => "form-control") %>
---
SELECT "restaurants".* FROM "restaurants"