app/views/experiences/new.html.erb

SELECT  "restaurants".* FROM "restaurants"  ORDER BY "restaurants"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "restaurants"
---
                  State:
                  <% if Restaurant.count == 0 %>