app/views/restaurants/index.html.erb


              <% if restaurant.experiences.count == 0 %>
---
SELECT "experiences".* FROM "experiences"