app/controllers/experiences_controller.rb

SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = ?  [["user_id", 2]]
---
  def index
    @experiences = Experience.where(:user_id => current_user.id)

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", 9]]
---
  def show
    @experience = Experience.find(params[:id])

SELECT  "experiences".* FROM "experiences"  ORDER BY "experiences"."id" DESC LIMIT 1
SELECT  "restaurants".* FROM "restaurants"  ORDER BY "restaurants"."id" DESC LIMIT 1
---
  def new
    @current_time = Time.new.strftime("%m-%d-%Y")
    @experience = Experience.new
    @restaurant = Restaurant.new
    @experiences = Experience.all
    @restaurants = Restaurant.all

INSERT INTO "experiences" ("comments", "best", "worst", "restaurant_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["comments", "test"], ["best", "stuf"], ["worst", "stuf"], ["restaurant_id", 12], ["user_id", 1], ["created_at", "2015-05-31 19:51:07.474054"], ["updated_at", "2015-05-31 19:51:07.474054"]]
---
  def create
    @restaurants = Restaurant.all
    @experience = Experience.new
    @experience.comments = params[:comments]
    @experience.best = params[:best]
    @experience.worst = params[:worst]
    @experience.date = Chronic.parse(params[:date])
    @experience.rating = params[:rating]
    @experience.image = params[:image]
    @experience.restaurant_id = params[:restaurant_id]
    @experience.user_id = current_user.id

    if @experience.save

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", 5]]
---
  def edit
    @experience = Experience.find(params[:id])

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "experiences" SET "best" = ?, "updated_at" = ? WHERE "experiences"."id" = ?  [["best", "Filet Mignon with frittes"], ["updated_at", "2015-05-31 18:07:51.800838"], ["id", 7]]
---
  def update
    @experience = Experience.find(params[:id])

    @experience.comments = params[:comments]
    @experience.best = params[:best]
    @experience.worst = params[:worst]
    @experience.date = params[:date]
    @experience.rating = params[:rating]
    @experience.image = params[:image]
    @experience.restaurant_id = params[:restaurant_id]
    @experience.user_id = params[:user_id]


    if @experience.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = NULL LIMIT 1
SELECT COUNT(*) FROM "experiences" WHERE "experiences"."restaurant_id" = ?  [["restaurant_id", 23]]
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "experiences" WHERE "experiences"."id" = ?  [["id", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 23]]
---
  def destroy
    @restaurant = Restaurant.find(params[:restaurant_id])

    if @restaurant.experiences.count == 1
      @experience = Experience.find(params[:id])
      @experience.remove_image!

      @experience.destroy
      @restaurant.destroy