app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
    @experiences = Experience.all
---
SELECT "restaurants".* FROM "restaurants"
SELECT "experiences".* FROM "experiences" WHERE "experiences"."restaurant_id" = ?  [["restaurant_id", 6]]

  def show
    @restaurant = Restaurant.find(params[:id])
    @experiences = Experience.all
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 8]]
SELECT "experiences".* FROM "experiences"

  def create
    @restaurant = Restaurant.new
    venue_name = params[:venue_name].split(' ')
    venue_name = venue_name.map(&:capitalize).join(' ')
    @restaurant.venue_name = venue_name
    @experiences = Experience.all

     factual = Factual.new("Kxa1eA6u24jMllpv2EuhQtPse084AWMZ2pnTuNoN","20kMPivt9eJwzt2SLYHNPSWosrtcYkw3jpqG83ng")


    if results = factual.table("places-us").search("#{@restaurant.venue_name}").filters("$and" => [{"category_ids" => {"$includes" => 338}}, {"locality" => "chicago"}]).rows != []

      results = factual.table("places-us").search("#{@restaurant.venue_name}").filters("$and" => [{"category_ids" => {"$includes" => 338}}, {"locality" => "chicago"}]).rows

      @restaurant.venue_name = results[0]["name"]
      @restaurant.address = results[0]["address"]
      @restaurant.city = results[0]["locality"]
      @restaurant.state = results[0]["region"]
      @restaurant.food_type = results[0]["category_labels"][0][3]


    else

      @restaurant.address = "Unavailable"

    end




    if @restaurant.save
---
INSERT INTO "restaurants" ("venue_name", "address", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["venue_name", "Carnival Foods"], ["address", "458 W Dickens Ave"], ["city", "Chicago"], ["state", "IL"], ["created_at", "2015-06-03 05:47:30.033980"], ["updated_at", "2015-06-03 05:47:30.033980"]]

  def edit
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 8]]

  def update
    @experiences = Experience.all
    @restaurant = Restaurant.find(params[:id])

    @restaurant.venue_name = params[:venue_name]

    @restaurant.food_type = params[:food_type]

    @restaurant.address = params[:address]



    if @restaurant.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "restaurants" SET "venue_name" = ?, "address" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["venue_name", "Coast Sushi Bar"], ["address", "Wicker Park"], ["updated_at", "2015-06-03 16:50:41.777649"], ["id", 79]]

  def destroy
    @restaurant = Restaurant.find(params[:id])

    @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]